nce2_53.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>nce2_53</title>
<!-- 2014-09-22 Mon 00:32 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Gu Feng" />
<link rel="stylesheet" type="text/css" href="css/code-hover.css" />
</head>
<body>
<div id="content">
<h1 class="title">nce2_53</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. It didn't cost much to repair the castle. <code>Damage was confined to a small portion of it</code>.</a></li>
<li><a href="#sec-2">2. Look at that model girl over there, <code>she must has the perfect body proportion</code>.</a></li>
<li><a href="#sec-3">3. If you all do not have a better solution, <code>I have a proposition</code>.</a></li>
<li><a href="#sec-4">4. They have put out the forest fire, but they still need to find <code>how the fire began</code>.</a></li>
<li><a href="#sec-5">5. Cigarette butts can also be called <code>cigarette ends</code>.</a></li>
<li><a href="#sec-6">6. They have been trying to find out how the fire began. However, a fireman accidentally <code>discovered the cause</code>.</a></li>
<li><a href="#sec-7">7. He noticed the remains of a snake <code>which was wound round the electric wires of a 16,000 volt power line</code>.</a></li>
<li><a href="#sec-8">8. The strange phenomenon baffled all of us, but finally <code>he solve the mystery</code>.</a></li>
<li><a href="#sec-9">9. A bird had <code>snatched up</code> the snake and <code>dropped it on to</code> electric wires.</a></li>
<li><a href="#sec-10">10. In order to persuade him to change his mind, <code>I reasoned with him for hours</code>.</a></li>
<li><a href="#sec-11">11. The smoke has come out, when <code>I smelled something burning</code>.</a></li>
<li><a href="#sec-12">12. <code>On my going to</code> the kitchen, I found it full of smoke.</a></li>
<li><a href="#sec-13">13. I was busy mixing butter and flour and my hands were <code>covered with stick pastr</code>.</a></li>
<li><a href="#sec-14">14. At that time, they always laughed at me. <code>Nothing could have been more annoying</code>.</a></li>
<li><a href="#sec-15">15. I went to open the door eagerly, but <code>I was dismayed when I found out it was not her</code>.</a></li>
<li><a href="#sec-16">16. Some doors do not have <code>doorknob</code> on the outside.</a></li>
<li><a href="#sec-17">17. I had no sooner got back to the kitchen than doorbell <code>rang loud enough to wake the dead</code>.</a></li>
<li><a href="#sec-18">18. The postman wanted me to <code>sign for a registered letter</code>.</a></li>
<li><a href="#sec-19">19. That event <code>prompted me to write</code> a letter to him.</a></li>
<li><a href="#sec-20">20. I'm very pleased <code>to learn that</code> you a well.</a></li>
<li><a href="#sec-21">21. In a letter, the first paragraph should be <code>Thank you for letter</code>.</a></li>
</ul>
</div>
</div>
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no">

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> It didn't cost much to repair the castle. <code>Damage was confined to a small portion of it</code>.</h2>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Look at that model girl over there, <code>she must has the perfect body proportion</code>.</h2>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> If you all do not have a better solution, <code>I have a proposition</code>.</h2>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> They have put out the forest fire, but they still need to find <code>how the fire began</code>.</h2>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Cigarette butts can also be called <code>cigarette ends</code>.</h2>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> They have been trying to find out how the fire began. However, a fireman accidentally <code>discovered the cause</code>.</h2>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> He noticed the remains of a snake <code>which was wound round the electric wires of a 16,000 volt power line</code>.</h2>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> The strange phenomenon baffled all of us, but finally <code>he solve the mystery</code>.</h2>
</div>
<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> A bird had <code>snatched up</code> the snake and <code>dropped it on to</code> electric wires.</h2>
</div>
<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> In order to persuade him to change his mind, <code>I reasoned with him for hours</code>.</h2>
</div>
<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> The smoke has come out, when <code>I smelled something burning</code>.</h2>
</div>
<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> <code>On my going to</code> the kitchen, I found it full of smoke.</h2>
</div>
<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> I was busy mixing butter and flour and my hands were <code>covered with stick pastr</code>.</h2>
</div>
<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> At that time, they always laughed at me. <code>Nothing could have been more annoying</code>.</h2>
</div>
<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> I went to open the door eagerly, but <code>I was dismayed when I found out it was not her</code>.</h2>
</div>
<div id="outline-container-sec-16" class="outline-2">
<h2 id="sec-16"><span class="section-number-2">16</span> Some doors do not have <code>doorknob</code> on the outside.</h2>
</div>
<div id="outline-container-sec-17" class="outline-2">
<h2 id="sec-17"><span class="section-number-2">17</span> I had no sooner got back to the kitchen than doorbell <code>rang loud enough to wake the dead</code>.</h2>
</div>
<div id="outline-container-sec-18" class="outline-2">
<h2 id="sec-18"><span class="section-number-2">18</span> The postman wanted me to <code>sign for a registered letter</code>.</h2>
</div>
<div id="outline-container-sec-19" class="outline-2">
<h2 id="sec-19"><span class="section-number-2">19</span> That event <code>prompted me to write</code> a letter to him.</h2>
</div>
<div id="outline-container-sec-20" class="outline-2">
<h2 id="sec-20"><span class="section-number-2">20</span> I'm very pleased <code>to learn that</code> you a well.</h2>
</div>
<div id="outline-container-sec-21" class="outline-2">
<h2 id="sec-21"><span class="section-number-2">21</span> In a letter, the first paragraph should be <code>Thank you for letter</code>.</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Gu Feng</p>
<p class="date">Created: 2014-09-22 Mon 00:32</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.93.1 (<a href="http://orgmode.org">Org</a> mode 8.2.6)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
